import 'package:azkaar/features/azkarr/presentation/views/widgets/notificatins_card.dart';
import 'package:flutter/material.dart';

class MorningAzkarBody extends StatelessWidget {
  const MorningAzkarBody({super.key});

  @override
  Widget build(BuildContext context) {
    List<String> MorningAzkar = [
      "أصبحنا و أصبح الملك لله، و الحمد لله، لا إله إلا الله وحده لا شريك له، له الملك و له الحمد وهو على كل شئ قدير، رب أسألك خير ما في هذا اليوم  و خير ما بعده، وأعوذ بك من شر ما في هذا اليوم و شر ما بعده، رب أعوذ بك من الكسل، و سوء الكبر، رب أعوذ بك من عذاب في النار و عذاب في القبر",
      "اللهم بك أصبحنا، و بك أمسينا، و بك نحيا، و بك نموت، و اليك النشور",
      " اللهم أنت ربي لا إله إلا أنت، خلقتني و أنا عبدك، و أنا على عهدك و وعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، و أبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ",
      " اللهم إني أصبحت أشهد ك  و أشهد حملة عرشك، و ملائكتك  و جميع خلقك، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك، و أن محمدا عبدك و رسولك - (أربع مرات)",

      " اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك  وحدك لا شريك لك، فلك الحمد ولك الشكر ",

      " اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت . اللهم إني أعوذ بك من الكفر، و الفقر، و أعوذ بك من عذاب القبر، لا إله إلا أنت - (ثلاث مرات) ",

      " حسبي الله لا إله إلا هو عليه توكلت و هو رب العرش العظيم - (سبع مرات) ",

      " اللهم إني أسألك العفو و العافية في الدنيا و الأخره، اللهم  إني أسألك العفو و العافية، في ديني و دنياي و أهلي، و مالي، اللهم استر عوراتي، و آمن روعاتي، اللهم احفظني من بين يدي، و من خلفي، و عن يميني، و عن شمالي،  و من فوقي، و أعوذ بعظمتك إن أغتال من تحتي  ",

      " اللهم عالم الغيب و الشهادة فاطر السموات و الأرض، رب كل شئ و مليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي، و من شر الشيطان و شركه، و أن أقترف على نفسي سوءا، أو أجره إلى مسلم ",

      " بسم الله الذي لا يضر مع اسمه شئ في الأرض و لا في السماء وهو السميع العليم - (ثلاث مرات) ",

      " رضيت بالله ربا، و بالإسلام دينا، و بمحمد صلى الله عليه و سلم نبيا - (ثلاث مرات) ",

      " يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله و لا تكلني إلى نفسي طرفة عين ",

      " أصبحنا و أصبح الملك لله رب العالمين، اللهم إني أسألك خير هذا اليوم : فتحه، و نصره و نوره و بركته و هداه، و أعوذ بك من شر ما فيه و شره ما بعده ",

      " أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص، و على دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم، حنيفا مسلما وما كان من المشركين ",

      " سبحان الله و بحمده - (مائة مره) ",

      " لا إله إلا الله وحده لا شريك له، له الملك و له الحمد، وهو على كل شئ قدير - (عشر مرات) أو (مرة واحدة عند الكسل) ",

      " لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد و هو على كل شئ قدير- (مائة مرة إذا أصبح) ",

      " سبحان الله و بحمده : عدد خلقه، و رضا نفسه، و زنة عرشه، و مداد كلماته - (ثلاث مرات أذا أصبح) ",
    ];
    return Column(
      children: [
        NotificatinsCard(),
        Expanded(
          child: Padding(
            padding: const EdgeInsets.only(
              top: 10,
              right: 10,
              left: 10,
              bottom: 10,
            ),
            child: ListView.builder(
              itemCount: MorningAzkar.length,
              scrollDirection: Axis.vertical,
              itemBuilder: (context, index) {
                return Padding(
                  padding: const EdgeInsets.only(top: 10),
                  child: Container(
                    width: 350,
                    decoration: BoxDecoration(
                      color: Color(0xfff5d59c),

                      borderRadius: BorderRadius.circular(16),
                    ),
                    child: Padding(
                      padding: EdgeInsets.symmetric(horizontal: 8, vertical: 6),
                      child: Text(
                        textAlign: TextAlign.right,
                        MorningAzkar[index],
                      ),
                    ),
                  ),
                );
              },
            ),
          ),
        ),
      ],
    );
  }
}
