import 'package:azkaar/features/azkarr/presentation/views/widgets/night_botif_card.dart';
import 'package:flutter/material.dart';

class NightAzkaarBody extends StatelessWidget {
  const NightAzkaarBody({super.key});

  @override
  Widget build(BuildContext context) {
    List<String> NightAzkaar = [
      "عوذ بكلمات الله التامات من شر ما خلق",

      "(بسم الله الذى لا يضر مع اسمه شيء فى الأرض ولا فى السماء وهو السميع العليم)، ثلاث مرات.",
      "(اللهم أنت ربى، لا إله إلا أنت، خلقتنى وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك على، وأبوء لك بذنبى فاغفر لى، فإنه لا يغفر الذنوب إلا أنت).",
      "(اللهم بك أمسينا، وبك أصبحنا، وبك نحيا وبك نموت، وإليك المصير).",
      "(اللهم إنى أسألك العفو والعافية فى الدنيا والآخرة، اللهم إنى أسألك العفو والعافية فى دينى ودنياى وأهلى ومالى، اللهم استر عوراتى، وآمن روعاتى، واحفظنى من بين يدى ومن خلفى، وعن يمينى وعن شمالى ومن فوقى، وأعوذ بك أن أغتال من تحتي).",
      "(اللهم إنى أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين، وغلبة الرجال).",
      "(اللهم عالم الغيب والشهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسى، وشر الشيطان وشركه/وشركه) قله إذا أصبحت، وإذا أمسيت، وإذا أخذت مضجعك.",
      "(يا حى يا قيوم: برحمتك أستغيث، أصلح لى شأنى كله، ولا تكلنى إلى نفسى طرفة عين).",
      "(سبحان الله وبحمده) مئة مرة: لم يأت أحد يوم القيامة بأفضل مما جاء به، إلا أحد قال مثل ما قال، أو زاد عليه.",
      "(سبحان الله وبحمده، عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته)، ثلاث مرات.",
      "(اللهم إنى أمسيت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك: أنك أنت الله لا إله إلا أنت، وأن محمدا عبدك ورسولك)، أربع مرات.",
      "قراءة سورة الإخلاص، والمعوذتين، ثلاث مرات. قال رسول الله صلى الله عليه وسلم:(قل هو الله أحد، والمعوذتين حين تمسى وحين تصبح، ثلاث مرات، يكفيك من كل شئ)",
      "سورة الإخلاص:﴿قل هو الله أحد۝١ الله الصمد۝٢ لم يلد ولم يولد۝٣ ولم يكن له كفوا أحد۝٤﴾.",
      " سورة الفلق:﴿قل أعوذ برب الفلق۝١ من شر ما خلق۝٢ ومن شر غاسق إذا وقب۝٣ ومن شر النفاثات فى العقد۝٤ ومن شر حاسد إذا حسد۝٥﴾.",
      "• سورة الناس:﴿قل أعوذ برب الناس۝١ ملك الناس۝٢ إله الناس۝٣ من شر الوسواس الخناس۝٤ الذى يوسوس فى صدور الناس۝٥ من الجنة والناس۝٦"
          " (اللهم إنى أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا)",
    ];

    return Column(
      children: [
        NightBotifCard(),
        Expanded(
          child: Padding(
            padding: const EdgeInsets.only(
              top: 10,
              right: 10,
              left: 10,
              bottom: 10,
            ),
            child: ListView.builder(
              itemCount: NightAzkaar.length,
              scrollDirection: Axis.vertical,
              itemBuilder: (context, index) {
                return Padding(
                  padding: const EdgeInsets.only(top: 10),
                  child: Container(
                    width: 350,
                    decoration: BoxDecoration(
                      color: Color(0xfff5d59c),

                      borderRadius: BorderRadius.circular(16),
                    ),
                    child: Padding(
                      padding: EdgeInsets.symmetric(horizontal: 8, vertical: 6),
                      child: Text(
                        textAlign: TextAlign.right,
                        NightAzkaar[index],
                      ),
                    ),
                  ),
                );
              },
            ),
          ),
        ),
      ],
    );
  }
}
